#สรุปคำสั่ง Git Command พื้นฐานที่นิยมใช้บ่อยที่สุด

คำสั่งเริ่มต้นโปรเจกต์

- git init : สั่งให้ Git เริ่มติดตามโฟลเดอร์นี้ (เปรียบเหมือนการสร้างสมุดบันทึกเล่มใหม่)

- git clone <URL> : คัดลอกโปรเจกต์จาก GitHub ลงมาที่เครื่องตัวเอง

คำสั่งบันทึกงาน ( Save )

- git status : เช็กดูว่ามีไฟล์ไหนโดนแก้ไข หรือไฟล์ไหนยังไม่ได้บันทึกบ้าง

- git add . : เลือกไฟล์ทั้งหมดเตรียมพร้อมที่จะบันทึก

- git commit -m "ข้อความอธิบาย" : บันทึกประวัติเวอร์ชันงานจริง พร้อมเขียนโน้ตสั้นๆ ว่าแก้/ทำอะไรไป

คำสั่งรับ-ส่งงานกับ GitHub

- git push : ส่งโค้ดที่บันทึกแล้วในเครื่องขึ้นไปบน GitHub

- git pull : ดึงโค้ดล่าสุดจาก GitHub ลงมาอัปเดตที่เครื่องเรา